app/controllers/pics_controller.rb

  def new
    case
      when params[:request_id]
        obj           = Request.find(params[:request_id])
        @picable_type = obj.type
        @destination  = edit_request_path(obj)
      when params[:provider_id]
        obj           = Provider.find(params[:provider_id])
        @picable_type = 'User' # Won't work when set to 'Provider'. Why?
        @destination  = edit_provider_path(obj)
      when params[:article_id]
        obj           = Article.find(params[:article_id])
        @picable_type = 'Article'
        @destination  = edit_article_path(obj)
      when params[:todo_catalogue_item_id]
        obj           = TodoCatalogueItem.find(params[:todo_catalogue_item_id])
---
SELECT * FROM `todo_catalogue_items` WHERE (`todo_catalogue_items`.`id` = 11)

  def create
    @pic = Pic.new(params[:pic])

    respond_to do |format|
      if @pic.save
---
INSERT INTO `pics` (`caption`, `picable_type`, `updated_at`, `pic_content_type`, `pic_file_name`, `pic_updated_at`, `picable_id`, `pic_file_size`, `created_at`, `position`) VALUES(NULL, 'TodoCatalogueItem', '2012-06-15 15:45:20', 'image/jpeg', '4aLDS_-_Imgur.jpg', NULL, 11, 85257, '2012-06-15 15:45:20', 4)