app/controllers/sessions_controller.rb

  def create
    @user = if params[:session]
              ::User.authenticate(params[:session][:email], params[:session][:password])
            else
              ::User.find_facebook_user(cookies[BlueLightSpecial.configuration.facebook_api_key + "_session_key"],
                                        cookies[BlueLightSpecial.configuration.facebook_api_key + "_user"])
---
SELECT * FROM `users` WHERE (users.email = 'brucew@pobox.com') LIMIT 1