app/controllers/todo_items_controller.rb

SELECT * FROM `todo_items` WHERE ((`todo_items`.`done` = 1) AND (`todo_items`.creator_id = 1)) ORDER BY created_at DESC
SELECT count(*) AS count_all FROM `todo_items` WHERE ((`todo_items`.`done` = 0) AND (`todo_items`.creator_id = 1))
---
  def history
    @myhome = "myhome"#to select current menu
    @o = params[:o]
    @q = params[:q] || {}
    search = @o.nil? ? @q.merge(:by_created_at => true) : @q.merge(@o => true)

    @todo_items = current_user.todo_items.done.search(search).all
    @timeline_feed = current_user.todo_items.done.sort_by{|t| t.done_on }.map{|y| y.done_on} unless @todo_items.empty?

SELECT * FROM `todo_items` WHERE (`todo_items`.`id` = 220)
---
  def history_edit
    @todo_item = TodoItem.find(params[:id])

SELECT * FROM `todo_items` WHERE (`todo_items`.`id` = 220)
UPDATE `todo_items` SET `updated_at` = '2012-06-15 21:37:16', `done_on` = '2012-06-15', `notes` = 'blah', `reminder_on` = '2012-04-08' WHERE `id` = 220
---
  def history_update
    @todo_item = TodoItem.find(params[:id])
    respond_to do |format|
      if @todo_item.update_attributes(params[:todo_item])