app/controllers/todo_catalogue_items_controller.rb

SELECT * FROM `todo_catalogue_items`
---
  def index
    @todo_catalogue_items = TodoCatalogueItem.all

SELECT * FROM `todo_catalogue_items` WHERE (`todo_catalogue_items`.`id` = 11)
---
  def show
    @todo_catalogue_item = TodoCatalogueItem.find(params[:id])

SELECT * FROM `todo_catalogue_items` WHERE (`todo_catalogue_items`.`id` = 11)
---
  def edit
    @todo_catalogue_item = TodoCatalogueItem.find(params[:id])

SELECT * FROM `todo_catalogue_items` WHERE (`todo_catalogue_items`.`id` = 11)
---
  def update
    @todo_catalogue_item = TodoCatalogueItem.find(params[:id])