app/controllers/users_controller.rb

  def create
    respond_to do |format|
      @user = ::User.new params[:user]
      #if !params[:user][:first_name] && !params[:user][:last_name]
      #  @user.first_name = 'noname'
      #  @user.last_name = 'noname'
      #end
      @user.facebook_uid = session[:user_facebook_uid]
      if @user.save
---
INSERT INTO `users` (`email`, `created_at`, `salt`, `lng`, `avatar_updated_at`, `default_reminder`, `location`, `first_name`, `facebook_uid`, `business_name`, `phone`, `trade`, `role`, `eula_agreed`, `facebook_session`, `email_confirmed`, `avatar_file_name`, `average_rating`, `paid`, `last_name`, `site`, `volunteer`, `type`, `about`, `avatar_content_type`, `updated_at`, `lat`, `compensation`, `avatar_file_size`, `unskilled`, `confirmation_token`, `encrypted_password`, `remember_token`, `password_reset_token`) VALUES('test@test.test', '2012-06-22 18:13:01', 'a03350577ab81550f56d1782016c07b1a506e79d', NULL, NULL, 1, NULL, 'Test', NULL, NULL, NULL, NULL, NULL, 0, NULL, 0, NULL, 0.0, NULL, 'Testerman', NULL, NULL, NULL, NULL, NULL, '2012-06-22 18:13:01', NULL, NULL, NULL, 0, 'bc204ce0e40a90e6476d92814d706ab60eca2022', '127381676ee9dde2a6136fbf6b27329a118069c2', '88aa1c050c0395ca01a5da4a73eafaa436a0f125', NULL)